[
    "For today, I used it to just set the app up and get familiar with the interface and the concept of the application. My overall experience was a 6 as it was fun and entertaining to set the game up. I enjoyed seeing my character coming to life and being able to name it. I was able to feed, pet, and play fetch with my pet. The set up was well explained. I was able to level up to level 2 and was able to figure out my daily tasks to receive more points. I completed two of the three. The only thing I struggled with was figuring out how to find food in some “foliage.” I was unaware that I had to swipe my finders over some plants to find food. I was unable to interact with anyone in the game though as I was just at my house today and not at a public location and I currently do not know anyone that plays the app. Overall, I experienced positive emotions and excitement with just the slight and short frustration from not knowing how to find food for my pet.",
    "Today I played a game with my sister. She had just downloaded the application, so I was able to help her some and it was fun to play with someone else. My enjoyment of the application today was a 5 because I enjoyed playing the application with my sister however there were a few things that hindered maximum enjoyment. I felt a level of 4 connected to Miranda Ulrey, my sister, through the application. My sister hatched her peridot and learned quickly how to interact with it. We tried to use the add a friend feature. It started to look like it worked as in we were able to quickly add each other. However, in our friend log, neither of our names popped up in the friend log and this caused some frustration. I then tried to add her as a friend and it said we were already friends so we were quite confused. Even though we had this problem, I still enjoyed happy emotions while playing this game today. It was fun to do the same thing on my own phone with another person. Although we did not go outside, it got us up and moving around and walking. Overall, I took this session as a good relaxing moment where I was able to connect with my sister despite the annoyance of adding a friend not working correctly.",
    "Later that day I played with my brother, Gannon Ulrey. Overall, I would rate the app experience as a 6.5 as I was extremely engaged and there were limited annoyances during the experience. I would say I was a level 7 connected with other people who engaged in the application. One feature we used today was the daily tasks, specifically the task “show your peridot to a dog or cat.” We were both able to complete this task but not the proper way, which was funny. Instead of showing either a dog or cat on our screen we showed chickens as I have chickens. Although this feature did not work correctly, it brought me close to my brother as we found it funny. Also, we tried to add each other as friends but this did not work like mentioned in the previous journal. We also unlocked the trick feature on the application which added some fun as it helped us engage with the app even more. During this session I experienced joy through playing the game with someone who thoroughly enjoyed the app. My brother still played the game after I had stopped playing, which I found to be relieving as I had shown him this game. This session was a good break from the day, a good bonding experience with my brother. Even though there were those two errors mentioned, this experience was thoroughly enjoyable.",
    "Today I had some free time, so I decided to play a game and go to the park that is across from my house. Overall, my experience level was a 2 because I was walking most of the time with my Peridot and it got slightly boring. I also would rate my level of engagement a two as well, but this could just be because I am not quite that far into the game yet. I used the location feature during this session. The park came up on my screen when I got close to it which I thought was a cool feature. I was able to see nearby dots, however I was not able to match them as the app told me I needed to be an adult too. However, I was still able to send a message to the owner of a dot nearby (username: BishopMDRF). Although it was a little daunting and I am not exactly sure what I sent. While I reflect on this session, I do not feel really engaged nor did the application add to my experience and if anything hindered it. I enjoyed my walk; however, I did not enjoy holding my phone the phone time and looking at it as I was outside. The application did get me exercise and it rewarded me for this exercise through extra experience points and completion of daily tasks. I didn't really have any connection to other people though because although it said there were people nearby, I was not quite sure how to interact with any of them.",
    "Today I had some time in the airport as I was picking up a family member, so I decided to play the application. The overall experience I had today with my application was a 5. Again, like previous times, I was able to see nearby dots and nearby players, but I was unable to see who they were and by the time I had received any message back from just the one, I was already long gone from my location. Because of this, I would say my overall interaction with other people was a 3. During this session I walked around the baggage claim and I kept my phone on and the application up. During this session I used the daily and weekly tasks to keep myself occupied with the application. I wanted to begin to hatch a dot, however since I still had a teen dot I was unable to use this feature. During this time I also just explored the app and read out the traits and the archetypes that go along with each dot. To reflect on the session, I feel like the application provided me with enjoyment as I had some down and waiting time. And although, I could’ve just sat at one of the benches and just waited for the application to get me up and walking around. Although it was walking indoors, it was still physical activity by every meaning of it. Because of this I experienced positive emotions because of the application.",
    "Today I felt lazy when I woke up so I decided to get on the application. I would rate my experience as a 3.5 as it was average and did not cause too much extra positive emotions and caused a little bit of frustration. I would rate my engagement with others a 3. I texted both my brother and sister to check up on their dot which started some conversation which is why I would give it that rating. The feature I messed with was teaching my dot tricks. It explained well how to go about this so it was not hard how to figure this feature out. However, after I had trained my dot to do “paw” and the application told me the training was complete, I was now unaware how to go out doing this trick. I could not figure out how to make my dot give me “paw” without giving him food which caused some frustration. This is because I figured that that is what training complete meant for a trick just like in real life with a dog. To reflect on this session I would say overall the application did help me get some exercise. It got me up and out of bed and walked outside to the back yard as it is better to get food for my dot from the grass. It woke me up for my day and provided me with something to occupy my morning. Although I did not have a connection with anyone during this session, it still was a good session as I communicated with people indirectly.",
    "Today I took another walk over to the park across the street from my house. I would say my experience overall was a 6 as played with a new fun feature that allowed for a fun experience. During this session I did not interact with anyone directly so I would say that my level of connection with other people was one. I had just upgraded my peridot to an adult so the feature of hatching a dot was now available. It was slightly confusing to figure out how to do it at first but there were tips along the way to help me with it. This feature helped me show what the coins and the gems were there for. I thought it was cool that since I was at the park each little aspect of the park you could click on and it was called a habitat. At one of these is where I was able to hatch my dot. My emotions during this session had a lot of joy. Hatching a dot from my previous one was a lot of fun. The animations of this happening added to the experience. Also, now I have a new one that I get to play and grow as well.  Although I did not create a connection with anyone else now, this session will allow me to be able to create a connection with someone else in the future. Overall, I enjoyed this session and It provided me with a fulfilling break from some of the work I was doing.",
    "Today I played again with my sister. The overall experience I had this session was a 7. To match the 7 on my experience I also believe that the level of connectedness with other people, my sister specifically, was also a 7. The feature I used this session was to hatch a dot with a friend. At some point which I am not sure when, my sister showed in my friend log finally. We were able to hatch our dots together to make a new dot. This was cool because we were both thoroughly engaged with the application and each other’s. To reflect on the session, I really enjoyed it. It got us up and moving around as we had gone out to our backyard to play the game. It always was provided as a form for a way to spend time with someone else and bond over the application. Because now I have a baby dot on my phone which belongs to my sisters. Overall, this experience was very positive and was a good way to spend part of my morning.",
    "During this session my mother got the application and played it with me. Overall I would say my session was a 6 as I was engaged with the application and showing it to my mother. I would rate my level of connectedness to other people during this session a 7 as I was playing it with my mother. During this session I showed my mom about all the basic features and how to play the game. I showed her my three dots and what you can do with them. She enjoyed hatching the dot and playing to begin with however, since she is older and not as good with technology, she struggled a little bit more with the game. The camera was always not angled at the right spot which made fetch hard and for her to sometimes see her dot correctly. Even with all this, I still would say this session caused a lot of positive emotions as it was fun to play with my mother. We took a walk outside too as I explained to her that you can get different food in the grass and the trees as compared to food just between the indoor hardwood floors and carpets. We laughed and joked about the application and were constantly showing each other their dots and putting our dots on each other. One thing that did cause a little bit of sadness is that fact that I can not see her dot on my screen at all even when she is right next to me. Overall, this was a good session that connected me to my mother and caused me to get up and go for a short walk.",
    "Today for the session I was just at my house and went for a walk. The enjoyment of the application was a 5 which is about the usual experience since I enjoy the application. The connectedness of the session was only a 1 today since I did not have any interaction with anyone else during the session. The features I used today were just to feed and play with my dot along with completing the daily tasks and current desires. I was able to continue to grow my new dots and train my older one. I enjoy watching them grow and watching me level up as a keeper. In this journal I just wanted to write about a few of the things my mother brought up to me. One she wishes she could turn on the sound without flicking the ringer on her phone on. And two, she wishes there was a way to see my dot on my phone when I am playing. The emotions I had during this session was just a feeling of enjoyment for the app. I was glad that I got up out of the chair to walk around to complete my dots desires which usually include some kind of walking. I enjoy seeing the progress of my family members through the friend list. And I enjoy that the one dot I have reminds me of my sister. Overall, this session was a good session.",
    "The novelty of this app attracted me a lot. This is my first time using this kind of app. Jiawei is my friend who also plays this app. I didn’t use this app with my friend on the first day. I only created a new dot and finished the tutorial on the first day. This cartoon-like design attracts me a lot. All UI design follows minimalism. The tutorial is clear. Even a child can finish the tutorial alone.It didn’t help me get outdoors or exercise right now. I feel relaxed after playing this app. Thus, it is a good break from my day; I emerged refreshed after playing this app. I compared my dot with my friend, and we talked about the characteristics of our dot because every dot is unique. My friend and I were so happy when we talked about our own dot; the characters of the dot are different.",
    "There are still many new features that are unknown to me. The social function didn’t work correctly, and we could not see each other after adding each other. After I opened the app, my dot was hungry, and the tutorial prompted me again to teach me how to feed my dot. This feature is good for users because sometimes the user will forget how to do specific actions. I fondle my dot after feeding and let her find some food by drawing a circle on the ground. There was a tiny bug when I first launched the app: the label's text was wrong. But all the bugs are gone after I reboot the app.It still didn’t help me get outdoors because I didn’t find the feature that needed me to go out. I have been relaxed and energetic after using this app because of the fondling experience. The fondling experience was excellent; the dot will snore when I fondle her. The app uses the phone's vibration to make the snoring so natural, especially when using the haptic touch of the iPhone. The combination of sound and vibration makes me feel like I’m rubbing a real cat.",
    "I was happy to find some new features of this app I have added my friend through this app, but I didn’t find some social features.I fed my dot, and I played tennis with my dot outside. I can throw my tennis out, and my dot will catch it back to me. There is still a drawback to this playing function which is that tennis has durability. I cannot play with my dot after I use all the table tennis up. This app starts helping me get outdoors because I want my dot to have a large space to play tennis. This app helps me get away from my keyboard. This app can recognize the wall. Thus the wall will bounce the tennis away, forcing me to go out. I feel energetic after playing this app with my friend outside. I also enjoy going out with my friend.",
    "I was happy to use this app. I am still confused about connect with others. I found that the app has a daily task where users get a certain amount of growth value for completing daily tasks. My dot wanted to go out for 1000 steps today and wanted to see the flowers, so I took my phone outside for a while. The app's object recognition was not very accurate. When I saw the flowers, I pointed my phone at them, but the app didn't recognize them accurately. But when I pointed my phone at a flower alone, the app successfully recognized the flower. So I finished my task for the day. This app helps me breathe fresh air and feel the warmth of the sunshine because of the daily tasks, and I get good outdoor activities. This app also facilitates my communication with others. While I was waiting for the software to recognize the flowers with my phone, a passerby saw my interface and asked me what I was doing, and I interacted with him. I felt so relaxed.",
    "I was happy to use this app. I can interact with other face-to face. Today my dot wanted to go see the cats and dogs, so I took my dot out. When I pointed the camera at the dog, my dot would interact with the dog, sometimes the dot would walk after the dog, or at other times it would run behind the dog to smell the dog. I think this feature is very immersive and can make me feel like I have a real pet. This app got me a lot of walking today because it's hard to find a dog. And because of that, I got a lot of exercise today. This app also facilitated my communication with others today, and I feel very happy and enjoyable. I had a good break while doing the task of finding the dog today, and I interacted with the owner of the dog.",
    "When I was out doing my daily tasks, I found this app with a map function. I also added friends through this. I need to walk near the marker to interact with the user. I think this is a good design because it encourages users to do more exercise. I went out and walked a lot because I wanted to see more different dots. So this app also helped me exercise today and gave me a good break. This app motivates people to make friends on the internet and also makes it easier for strangers to find common topics with each other. Today I feel like my social skills have improved because I chat with many people.",
    "I use “hatch-a-dot” function I trained my dot today and taught my dot some moves. This feature is also good for better user engagement. After the training, I found a good-looking dot through the map function and made my dot hatch a new dot with others' dots. This is also a good design to attract users. Today this app made me want to go out and exercise because I wanted to go find better-looking dots and also give me a break. This app also makes me feel very excited because I can let my dots hatch new dots. The app has enabled people to communicate online through the hatched-a-dot feature. The app also improved my communication skill as I sent out hatch-a-dot requests to some users and interacted with them.",
    "Today I found that my dot can follow my instructions to dig a hole in a designated place - draw a circle on the surface and then find some items in the hole. It could be food or toys. And the same surface will dig out the same items. I think this is a good design to encourage users to try on different surfaces and give them a better engagement. This app also made me want to go out today. Because I wanted to try to dig on more different surfaces. This app makes me feel relaxed. This app also lets me have more communication with my friends, because we share what kind of things we dig on the surface.",
    "I met another Peridot user today while I was out completing my daily tasks. We discussed some of the features of this app together. I found that there are a lot of features about Peridot that this user doesn't know. Although Peridot reminds the user of some features, it doesn't have something like a tutorial to tell the user about all the features.I also went out today because of this app. I completed my daily tasks. I also communicate with others during this time. The app also gave me a break from the day's work. Peridot has given me more opportunities to talk to strangers.",
    "This time my dot wanted to go see the water. So I took my dot to a pond. While looking at the pond I discovered that the dot can recognize different surfaces and know which ones can stand. The dot is flying in the sky when it is on the pond. This is an amazing design. It can increase the reality of peridot. Today I went out two times, in order to fulfill my dot's wish to see the water. I also felt very relaxed when I fulfilled my dot's wish again. Because I can put down the work in hand, and go outside for a walk, it lets me become more energetic to deal with the rest of the work. But today this app did not facilitate my communication with others.",
    "I would rate this session a 7/10. It was nice to take a break and go outside with this app. However, the experience got stale very quickly. My brother, Justin, downloaded this app alongside me and we engaged with the app in this session. The lever of connectedness with the person I engaged with is a 7/7 cause he’s family and we had a fun time with the app. During the session, I created a player name and hatched my very own Peridot. Then, I went through the tutorial. The tutorial made me engage with its pet interaction functionalities like petting and feeding. I could also let my Peridot dig up items at locations I highlight on my camera. The tutorial also taught me that completing certain actions will satisfy “Desires” which I can then redeem for Peridot growth. Overall, my experience with this app so far made me feel pretty refreshed. I used this app after a long day of work and it allowed me to get some fresh air and engage with a virtual pet. Any emotions within this session were shared with my brother. These were discussed between us. My brother and I emotionally connected with the simultaneous use of the app. We compared our Peridots and interacted with them in the same area.",
    "I would rate this session a 6/10. Again this was a nice time to take a break to use the app outside. The score is a bit lower than last time because it felt even more stale because I was repeating the same thing I did last session and I felt like no progress was made with my Peridot. I engaged with my brother again for this session. I would rate the connectedness a 5/7 this time because my brother felt the same as me about the app this time around. In this session, I played fetch with my Peridot a lot. I used different types of balls this time, which I think could have beneficial effects I’m not aware of. Additionally, I fed my Peridot with food I found in the app yesterday. I did these two activities until my Peridot was completely satisfied. I also made my Peridot dig around for some food and other items. Again, I redeemed any desires I completed. Overall, my experience this time around was mostly the same as last time but a bit tuned down. I felt refreshed to take a break. However, my enjoyment of the app was down compared to last session. My brother expressed the same thoughts.",
    "I would rate this session a 6/10 again. My sentiment this time is exactly the same as last time. However, I did feel like I made some progress with my Peridot. It looks like my Peridot will grow to a different stage in my next session. I also played the app indoors this time because it was getting kind of late. I played with my brother as usual. My connectedness rating is the same as last session as well for the same reason as my session rating: 5/7. I used the exact same features as last session like playing fetch, feeding, and petting. I did this until my Peridot was satisfied. At the end, I redeemed any desires I fulfilled. Overall, my experience this time was almost exactly the same as last session, albeit indoors instead of outdoors. I think my brother feels the same way. Any emotions within this session were shared with my brother. These were discussed between us.",
    "I would rate this session an 8/10. This current session has been the highlight of my time with this app so far because of the noticeable progress I made. I played with my brother again. He was anticipating this session too. My connectedness score will also be 7/7 because of what happened in this session. In this session, all the progress me and my brother made in this app culminated in the growth of our Peridot. Our Peridot moved on to stage 2 of their lifestyle. They became teens and their appearance changed as well. Additionally, I tried out the appearance customization feature for the first time. I equipped my Peridot with glasses. I also fed it an earthy onion. My brother and I felt pretty joyful this session due to the refreshing changes we experienced compared to the previous sessions. The new content increased our feelings of engagement and anticipation. Any emotions within this session were shared with my brother. These were discussed between us.",
    "I would rate this session a 6/10. I went back to the ordinary score because the experience became stale again after the last exciting session. Again, I used the app with my brother. My connectedness also reverted back to 5/7 due to the same reasons. I used the standard features that have become a habit for every session: feeding, playing, and scavenging with my Peridot. Our emotions reverted to the same feelings of standard sessions. Any emotions within this session were shared with my brother. These were discussed between us.",
    "I would rate this session a 6/10. I went with this ordinary score because the experience is the same thing yet again. Again, I used the app with my brother. My connectedness is also the same score I give to ordinary sessions 5/7 due to the same reasons. I used the standard features that have become a habit for every session: feeding, playing, and scavenging with my Peridot. Our emotions are the same feelings of standard sessions. Any emotions within this session were shared with my brother. These were discussed between us.",
    "I would rate this session a 6/10. I went with this ordinary score because the experience is the same thing yet again. Again, I used the app with my brother. My connectedness is also the same score I give to ordinary sessions 5/7 due to the same reasons. I used the standard features that have become a habit for every session: feeding, playing, and scavenging with my Peridot. Our emotions are the same feelings of standard sessions. Any emotions within this session were shared with my brother. These were discussed between us.",
    "I would rate this session a 7/10. My score is a bit higher this time because I finally got to do something new this time. My brother, obviously, played this session with me. My connectedness score is also a bit higher this time for the same reason: 6/7. We finally used the store feature due to a notification we received when we launched the app. The notification said that fee items could be redeemed from the in-game store. The free items were an item package and a pride bandana accessory for our Peridots to celebrate Pride Month. Naturally, I equipped this onto my Peridot. My brother repeated the same action. We also noticed that our Peridots are about to transition to the third stage of growth. We anticipate that this will happen during the next session. My emotions this time are more joyful than usual due to the refreshing new content and sense of progression.",
    "I would rate this session an 8/10. My score matches the previous highlight session due to the same reason: stage growth. My brother couldn’t miss this so he joined me. My connectedness score is 7/7 for the same reason. Our Peridots became adults during this session. My Peridot gained a “genius” personality trait. However, I don’t fully know what this trait feature entails. Also, I was told that my Peridot can pair with other Peridots to hatch their own brood now that they are adults. My account “keeper” leveled up to 3. As a result, I unlocked the tricks feature. This allows me to teach my Peridots tricks by training them with food. The way this feature works is that I have to train my Peridots with food a certain number of times to teach them any single trick. I wish I unlocked this feature sooner. I feel like this feature would have added more depth and enjoyment to my previous sessions. My emotion this time was happy and I got to fully enjoy this session without any feeling of repetitiveness from standard sessions. My brother feels the same way. Any emotions within this session were shared with my brother. These were discussed between us.",
    "I would rate this session a 6/10. I went back to the ordinary score because the experience became stale again after the last exciting session. Again, I used the app with my brother. My connectedness also reverted back to 5/7 due to the same reasons. I used the standard features that have become a habit for every session: feeding, playing, and scavenging with my Peridot. Our emotions reverted to the same feelings of standard sessions. However, we did feel a bit melancholic, knowing that this would be our last session using this app together. My brother shared the same sentiment. Any emotions within this session were shared with my brother. These were discussed between us.",
    "Fun to interact with my pet initially, but become bland quick. It was fun to see my pet for the first time. I moved around my room to see how the pet would react to certain angles. I played around with the controls to get a good feel with it, such as the double tap. But after the first 10 minutes, it started to become a bit bland, as there wasn’t much to do. This did not help me go outside, but it was a bit of a nice break from my day-to-day activities. I emerged from this situation as a bit bored, but it was still fun overall. I wasn’t able to convince my dad to try out the app yet.",
    "Was bored throughout the whole session. When the app was finished loading, I noticed there was daily login rewards. I like the idea of being rewarded for just logging in. But I noticed I wasn’t able to do a lot of things the app provides without creating an account or providing it location access. I also wasn’t able to purchase anything with in-game currency. It still hasn’t motivated me to go outside. I emerged from this situation bored. I haven’t played with anyone else just yet.",
    "Daily login rewards were nice, but it was still boring. My pet had empty bars for both the enjoyment and food bar. I fed him and played with a lot to make up for this. I believe it’s because I missed a day of login, which makes sense. I decided to try to keep logging in daily so this wouldn’t happen again. It hasn’t motivated me to go outside yet. I emerged from this situation not as bored as before, but still bored overall. I haven’t played with anyone yet.",
    "Disappointed on the limitations of a guest account. I wanted to try to make an account, but the only option was to connect it to my Google account. I went through their privacy policy, and decided not to as I felt uncomfortable with how much they’re tracking. So I just decided to play the game as before, fetching and feeding my pet. I did not go out yet. I emerged from this situation as very bored. I haven’t played with anyone yet, as my dad isn’t interested in participating just yet."
]